staging-load-test.yml
config:
  target: 'https://aws.good-thinking.uk/'
  phases:
    - duration: 1
      arrivalRate: 50
    - duration: 30
      arrivalCount: 100
  tls: {
    rejectUnauthorized: false
  }
scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/sleep-deprived/"
    - get:
        url: "/resources/be-mindful/"
    - get:
        url: "/sleep-deprived/"
    - get:
        url: "/resources/sleepio-london/"
    - get:
        url: "/sleep-deprived/"
    - get:
        url: "/resources/trauma-support/"
    - get:
        url: "/sleep-deprived/"
    - get:
        url: "/resources/calm-zone/"
    - get:
        url: "/sleep-deprived/"
    - get:
        url: "/resources/thought-diary-pro/"
    - get:
        url: "/self-assessment/"