staging-load-test.yml
config:
  target: 'https://ldmw-staging.herokuapp.com'
  phases:
    - duration: 30
      arrivalCount: 15
    - duration: 1
      arrivalRate: 15
    - duration: 30
      arrivalCount: 15
scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/trouble-sleeping/"
    - get:
        url: "/resources/sleepstation/"